In [1]:
import pandas as pd
import numpy as np

In [2]:
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
df.groupby(['Team','Year'])

In [4]:
list(df.groupby(['Team','Year']))

[(('CSK', 2015),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('CSK', 2016),
    Team  Rank  Year  Points
  6  CSK     1  2016     756),
 (('CSK', 2017),
    Team  Rank  Year  Points
  7  CSK     1  2017     788),
 (('Devils', 2014),
       Team  Rank  Year  Points
  2  Devils     2  2014     863),
 (('Devils', 2015),
       Team  Rank  Year  Points
  3  Devils     3  2015     673),
 (('Kings', 2014),
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 (('MI', 2014),
    Team  Rank  Year  Points
  0   MI     1  2014     876),
 (('MI', 2015),
    Team  Rank  Year  Points
  1   MI     2  2015     789),
 (('MI', 2016),
    Team  Rank  Year  Points
  8   MI     2  2016     694),
 (('MI', 2017),
     Team  Rank  Year  Points
  11   MI     2  2017     690),
 (('Royals', 2014),
       Team  Rank  Year  Points
  9  Royals     4  2014     701),
 (('Royals', 2015),
        Team  Rank  Year  Points
  10  Royals     1  2015     804)]

In [5]:
# take sum of all points yearwise
list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [6]:
out1 = df.groupby('Year')
list(out1['Points'])

[(2014,
  0    876
  2    863
  4    741
  9    701
  Name: Points, dtype: int64),
 (2015,
  1     789
  3     673
  5     812
  10    804
  Name: Points, dtype: int64),
 (2016,
  6    756
  8    694
  Name: Points, dtype: int64),
 (2017,
  7     788
  11    690
  Name: Points, dtype: int64)]

In [7]:
out1['Points'].sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [8]:
# teamwise summation of Points
df.groupby('Team')['Points'].sum()

Team
CSK       2356
Devils    1536
Kings      741
MI        3049
Royals    1505
Name: Points, dtype: int64

In [9]:
ans = df.groupby('Team').sum()
ans.Points

Team
CSK       2356
Devils    1536
Kings      741
MI        3049
Royals    1505
Name: Points, dtype: int64

In [10]:
# fetch only teams with rank 1
list(df.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

In [11]:
ans_2 = df.groupby('Rank').get_group(1)
ans_2.Team

0         MI
6        CSK
7        CSK
10    Royals
Name: Team, dtype: object

In [12]:
ans_2[['Team','Year']]

      Team  Year
0       MI  2014
6      CSK  2016
7      CSK  2017
10  Royals  2015

In [13]:
# fetch 1st entry of each category(rank) according to Team with Rank groupby
list(df.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

In [14]:
df.groupby('Rank').first()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

In [15]:
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [16]:
df.groupby('Team').first()

        Rank  Year  Points
Team
CSK        4  2015     812
Devils     2  2014     863
Kings      3  2014     741
MI         1  2014     876
Royals     4  2014     701

In [17]:
# teamwise last record
df.groupby('Team').last()

        Rank  Year  Points
Team
CSK        1  2017     788
Devils     3  2015     673
Kings      3  2014     741
MI         2  2017     690
Royals     1  2015     804

In [18]:
res = list(df.groupby('Team'))
for i, j in res:
    print(j)
    print()

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

    Team  Rank  Year  Points
4  Kings     3  2014     741

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [19]:
res = list(df.groupby('Team'))
for i, j in res:
    print(j.head(2))
    print()

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

    Team  Rank  Year  Points
4  Kings     3  2014     741

  Team  Rank  Year  Points
0   MI     1  2014     876
1   MI     2  2015     789

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [20]:
# Multiple column groupby
list(df.groupby(['Team','Rank']))

[(('CSK', 1),
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 (('CSK', 4),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('Devils', 2),
       Team  Rank  Year  Points
  2  Devils     2  2014     863),
 (('Devils', 3),
       Team  Rank  Year  Points
  3  Devils     3  2015     673),
 (('Kings', 3),
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 (('MI', 1),
    Team  Rank  Year  Points
  0   MI     1  2014     876),
 (('MI', 2),
     Team  Rank  Year  Points
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 (('Royals', 1),
        Team  Rank  Year  Points
  10  Royals     1  2015     804),
 (('Royals', 4),
       Team  Rank  Year  Points
  9  Royals     4  2014     701)]

In [21]:
df.groupby(['Team','Rank']).get_group(('MI', 2))

   Team  Rank  Year  Points
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [22]:
# i want the team who stood 1st max times in ipl
fst = df.groupby('Rank').get_group(1)
fst

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [23]:
team = fst.Team.value_counts()
team

CSK       2
MI        1
Royals    1
Name: Team, dtype: int64

In [24]:
team.nlargest(1)

CSK    2
Name: Team, dtype: int64

In [25]:
n = pd.DataFrame({'num':[980,100,300,280,30,160]})
n

   num
0  980
1  100
2  300
3  280
4   30
5  160

In [26]:
n.num.nlargest(3)

0    980
2    300
3    280
Name: num, dtype: int64

In [27]:
n.num.nsmallest(2)

4     30
1    100
Name: num, dtype: int64

In [28]:
# i want record of year 2017
df.groupby('Year')

In [29]:
list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [30]:
yr = df.groupby('Year').get_group(2017)
yr

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

### Aggregations:
    - sum mean median mode std
    - Aggregations work only on Numeric fields

In [31]:
grouped = df.groupby('Year')
grouped

In [32]:
grouped['Points']

In [33]:
list(df.groupby('Year')['Points'])

[(2014,
  0    876
  2    863
  4    741
  9    701
  Name: Points, dtype: int64),
 (2015,
  1     789
  3     673
  5     812
  10    804
  Name: Points, dtype: int64),
 (2016,
  6    756
  8    694
  Name: Points, dtype: int64),
 (2017,
  7     788
  11    690
  Name: Points, dtype: int64)]

In [34]:
points = df.groupby('Year')['Points']
points.agg(sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [35]:
points.agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [36]:
# Applying Multiple Aggregation Functions at Once
list(points)

[(2014,
  0    876
  2    863
  4    741
  9    701
  Name: Points, dtype: int64),
 (2015,
  1     789
  3     673
  5     812
  10    804
  Name: Points, dtype: int64),
 (2016,
  6    756
  8    694
  Name: Points, dtype: int64),
 (2017,
  7     788
  11    690
  Name: Points, dtype: int64)]

In [37]:
points.sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [38]:
points.agg([sum,min,max])

       sum  min  max
Year
2014  3181  701  876
2015  3078  673  812
2016  1450  694  756
2017  1478  690  788

In [39]:
# here size is nothing but occurance
y = df.groupby('Year')
y

In [40]:
list(y)

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [41]:
y.Team.agg(np.size)

Year
2014    4
2015    4
2016    2
2017    2
Name: Team, dtype: int64

## Transformation

In [42]:
# Transformation calling a function over the selected data
grouped = df.groupby('Team')
# write a function to add +500 points to each team
grouped

In [43]:
list(grouped)

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [44]:
grouped['Points'].transform(lambda x:x+500)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [45]:
df.Points

0     876
1     789
2     863
3     673
4     741
5     812
6     756
7     788
8     694
9     701
10    804
11    690
Name: Points, dtype: int64

In [46]:
list(df.groupby('Team')['Points'])

[('CSK',
  5    812
  6    756
  7    788
  Name: Points, dtype: int64),
 ('Devils',
  2    863
  3    673
  Name: Points, dtype: int64),
 ('Kings',
  4    741
  Name: Points, dtype: int64),
 ('MI',
  0     876
  1     789
  8     694
  11    690
  Name: Points, dtype: int64),
 ('Royals',
  9     701
  10    804
  Name: Points, dtype: int64)]

In [47]:
df.groupby('Team')['Points'].transform(lambda x:x+100)

0     976
1     889
2     963
3     773
4     841
5     912
6     856
7     888
8     794
9     801
10    904
11    790
Name: Points, dtype: int64

In [48]:
list(df.groupby('Team')['Rank'])

[('CSK',
  5    4
  6    1
  7    1
  Name: Rank, dtype: int64),
 ('Devils',
  2    2
  3    3
  Name: Rank, dtype: int64),
 ('Kings',
  4    3
  Name: Rank, dtype: int64),
 ('MI',
  0     1
  1     2
  8     2
  11    2
  Name: Rank, dtype: int64),
 ('Royals',
  9     4
  10    1
  Name: Rank, dtype: int64)]

In [49]:
# I want to give the +10 extra points to csk use transform
list(df.groupby('Team')['Points'])

[('CSK',
  5    812
  6    756
  7    788
  Name: Points, dtype: int64),
 ('Devils',
  2    863
  3    673
  Name: Points, dtype: int64),
 ('Kings',
  4    741
  Name: Points, dtype: int64),
 ('MI',
  0     876
  1     789
  8     694
  11    690
  Name: Points, dtype: int64),
 ('Royals',
  9     701
  10    804
  Name: Points, dtype: int64)]

In [50]:
tm = df.groupby('Team')['Points']
tm

In [51]:
tm.get_group('CSK')

5    812
6    756
7    788
Name: Points, dtype: int64

In [52]:
tm.get_group('CSK').transform(lambda x:x+10)

5    822
6    766
7    798
Name: Points, dtype: int64

In [53]:
# I want to give extra +10 point only to the teams from year 2015
y

In [54]:
list(y)

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [55]:
y.get_group(2015)

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [56]:
y.get_group(2015)['Points']

1     789
3     673
5     812
10    804
Name: Points, dtype: int64

In [57]:
y.get_group(2015)['Points'].transform(lambda x:x+10)

1     799
3     683
5     822
10    814
Name: Points, dtype: int64

In [58]:
# I want to give extra +200 point only to the teams from year 2014
y.get_group(2014)['Points']

0    876
2    863
4    741
9    701
Name: Points, dtype: int64

In [59]:
y.get_group(2014)['Points'].transform(lambda x:x+200)

0    1076
2    1063
4     941
9     901
Name: Points, dtype: int64